cute_url/app/Controllers/Main.php

    public function admin()
    {
        if (array_key_exists('user_session', session()->get())) {
            $qturl_m = new \App\Models\CuteUrl();
            $user = session()->get('user_session');

            $data['user'] = $user;
            $data['urls'] = $qturl_m
                ->where('user_id', $user['id'])
                ->orderBy('dtc', 'desc')
                ->findAll();
---
SELECT *
FROM `cute_url`
WHERE `user_id` = '2'
ORDER BY `dtc` DESC

    public function users()
    {
        if (array_key_exists('user_session', session()->get())) {

            $user_m = new \App\Models\UserAccount();

            $user = session()->get('user_session');

            if (array_key_exists('user_id', $this->request->getGet())) {

                $data['edit_user'] = $user_m->find($this->request->getGet('user_id'));
            }

            $data['user'] = $user;
            $data['users'] = $user_m
                ->where('id !=', $user['id'])
                ->orderBy('dtc', 'desc')
                ->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'
SELECT *
FROM `users`
WHERE `id` != '2'
ORDER BY `dtc` DESC

                        $edit['passw'] = password_hash($password, PASSWORD_ARGON2ID);
                    }

                    $user_m->save($edit);
---
UPDATE `users` SET `id` = '3', `short_name` = 'Jonathan Wick', `username` = 'johnwick'
WHERE `users`.`id` IN ('3')